[
    {
        "rating": 5,
        "text": "Very customer service friendly. Easy to get in contact with. Quick responses.",
        "date": "2025-01-30T06:37:25.000Z",
        "reviewer": "First Time Customer - CA",
        "replies": "[\"Thank you for your business, Mr. Mancia!\"]"
    },
    {
        "rating": 5,
        "text": "The quick response was very helpful and informative as to what documents I needed and how to get them!",
        "date": "2025-01-23T23:36:04.000Z",
        "reviewer": "LOUIS",
        "replies": "[\"Thank you for your business, Mr. Cooper!\"]"
    },
    {
        "rating": 1,
        "text": "Refinancing has been a hassle. They have decided they need to see my current paycheck deposit . Even though I use 2 accounts. There is nothing on their website or emails that state they need to see payroll deposits. They make up rules as they go. It is not a typical payday loan. I set up an allotment and have been timely for over a year the zero issues in a stable government job.  They just made up a rule.",
        "date": "2025-01-02T18:33:08.000Z",
        "reviewer": "customer",
        "replies": "[\"Thank you for your continued business, Ms. Yates. However, a 30-day bank statement is now a required document, which is included in our required documents under our apply now tab on our website. It is required because the debit card to the account is our collateral on our loans. Please reach out if you have further questions.\"]"
    },
    {
        "rating": 5,
        "text": "Thank you all for always a great experience.",
        "date": "2025-01-23T23:05:09.000Z",
        "reviewer": "Mondai Rubin",
        "replies": "[\"Thank you for your business, Ms. Rubin!\"]"
    },
    {
        "rating": 5,
        "text": "Good customer service very easy and patient",
        "date": "2025-01-24T23:45:09.000Z",
        "reviewer": "Tamequa Minnitt",
        "replies": "[\"Thank you for your business, Ms. Minnitt!\"]"
    },
    {
        "rating": 5,
        "text": "The people on the phone were extremely helpful. The process was very quick. I Wish you had a better / easier process when refinancing. Other companies have it 5x easier to do so. (no need to prove bank information if going to same as before) just needed updated payroll.",
        "date": "2024-11-27T22:22:24.000Z",
        "reviewer": "Andrew",
        "replies": "[\"Thank you for your business, Mr. Erglis!\"]"
    },
    {
        "rating": 5,
        "text": "Response from this company is immediate. Every email that is sent provides clear instructions. I’m very satisfied.",
        "date": "2024-12-27T20:35:25.000Z",
        "reviewer": "Kim",
        "replies": "[\"Thank you for your business, Ms. White!\"]"
    },
    {
        "rating": 5,
        "text": "Customer service was top notch and the process was very smooth and easy to follow.",
        "date": "2025-01-09T19:28:24.000Z",
        "reviewer": "Daniel Hall",
        "replies": "[\"Thank you for your business, Mr. Hall!\"]"
    },
    {
        "rating": 5,
        "text": "Excellent service! Fund account in a timely manner",
        "date": "2025-01-19T12:30:32.000Z",
        "reviewer": "rodrigo v",
        "replies": "[\"Thank you for your business!\"]"
    },
    {
        "rating": 5,
        "text": "Good customer service. Thank you, Nick!",
        "date": "2025-01-19T15:12:36.000Z",
        "reviewer": "Nash Grayson",
        "replies": "[\"Thank you for your business!\"]"
    },
    {
        "rating": 5,
        "text": "They were very helpful and a fast process",
        "date": "2025-01-22T22:57:29.000Z",
        "reviewer": "Kimberly Haynes",
        "replies": "[\"Thank you for your business, Ms. Haynes!\"]"
    },
    {
        "rating": 5,
        "text": "So many turned me down but auperiif funding was highly recommended by my peers ! They helped me tremendously and the experience was super easy and they totally met all my financial needs ! I am recommending them to all my co workers so their financial needs can be met as well",
        "date": "2024-08-20T23:03:03.000Z",
        "reviewer": "KASHONA MEACHUM",
        "replies": "[\"Thank you for your business, Ms. Meachum! Remember our referral bonus you can earn if your coworker(s) you recommend us to qualify and get a loan with us!\"]"
    },
    {
        "rating": 5,
        "text": "Upon applying to Superior Funding I was initially denied because they were not able to fund my department at that time. 2 days later they emailed and asked if I was still interested. The process was quick and easy. Any questions I had were answered and the service was great. I received my loan fast. Highly recommend.",
        "date": "2024-09-06T23:01:32.000Z",
        "reviewer": "Kia Holliday",
        "replies": "[\"Thank you for your business, Ms. Holliday!\"]"
    },
    {
        "rating": 5,
        "text": "No text",
        "date": "2025-01-20T19:16:05.000Z",
        "reviewer": "Emily johnson",
        "replies": "[\"Thank you for your business!\"]"
    },
    {
        "rating": 5,
        "text": "Since I learned all the steps needed to refinance, things are going much smoother, and FAST! It’s a little frustrating at first, to learn how to make a pdf file and sign the pda, w/o it looks like a kindergartner wrote it, lol, but once you learn all that, easy breezy.",
        "date": "2024-02-05T22:58:32.000Z",
        "reviewer": "ANGELA",
        "replies": "[\"Thank you for your business, Mrs. Williams!\"]"
    },
    {
        "rating": 5,
        "text": "Excellent customer service! I was not sure how to do the paperwork, so I called a few times (or more lol) they were always so helpful, patient, and kind. No matter how much I called or how many questions I asked, they were polite, knowledgeable, and made it simple and easy. I would highly recommend to my friends, family, and anyone reading this that may need cash fast! A big THANK YOU to SUPERIOR FUNDING for being there when I needed you the most... all the way around!!! From Great customer support to fast funding...You are awesome!!",
        "date": "2024-07-03T01:27:22.000Z",
        "reviewer": "Chandra Benfield",
        "replies": "[\"Thank you for your business, Ms. Benfield!\"]"
    },
    {
        "rating": 5,
        "text": "Awesome customer service and the process was very fast and easy.",
        "date": "2025-01-07T23:07:42.000Z",
        "reviewer": "ANTHONY BRYANT",
        "replies": "[\"Thank you for your business, Ms. Bryant!\"]"
    },
    {
        "rating": 5,
        "text": "I needed assist from the representative and when I called I actually got a live person!! The 2 different ladies I talked to were friendly and so helpful. I enjoyed speaking to a human and no jumping through hoops to get them on the phone.",
        "date": "2024-07-26T22:35:42.000Z",
        "reviewer": "Elizabeth Wickings",
        "replies": "[\"Thank you for your business, Ms. Wickings!\"]"
    },
    {
        "rating": 5,
        "text": "I have been using these amazing guys for years!! They are always there whenever I need them. They are quick to work on your paperwork and they process everything in a timely manner. I would definitely recommend them to others!! Thank you all for always being nice",
        "date": "2024-07-15T22:42:27.000Z",
        "reviewer": "Laporsha",
        "replies": "[\"Thank you for your business, Ms. Pitts!\"]"
    },
    {
        "rating": 5,
        "text": "I was referred to Superior Funding by a senior coworker during training earlier this year. It’s taken a few tries in getting approved. Today, I was respectfully granted the opportunity to receive funds to support my current budget.",
        "date": "2024-09-25T22:28:30.000Z",
        "reviewer": "April Lambert",
        "replies": "[\"Thank you for your business, Ms. Lambert!\"]"
    },
    {
        "rating": 5,
        "text": "The patients and quickness of the representative who service me made applying easy and even if I had not got the loan the thoughtfulness would have made it ok. . I had a loan with them before and paid if off and my experience was great then. I would and have recommend anyone who they allow to apply, apply. Thanks Always",
        "date": "2024-06-01T17:18:51.000Z",
        "reviewer": "Sonya Miller",
        "replies": "[\"Thank you for your business and your recommendations, Ms. Miller!\"]"
    },
    {
        "rating": 5,
        "text": "Everytime I call everyone is always polite and answers all my questions even when I have several. Lol",
        "date": "2024-11-25T22:54:49.000Z",
        "reviewer": "india smith",
        "replies": "[\"Thank you for your business, Ms. Smith!\"]"
    },
    {
        "rating": 5,
        "text": "Superior Funding provides excellent service in those in need. The process is very quick and easy I recommend them to anyone who need a quick loan. There customer service reps are the best. Keep up the good work ladies.",
        "date": "2024-06-26T13:56:53.000Z",
        "reviewer": "Dynel Williams",
        "replies": "[\"Thank you for your business, Ms. Williams!\"]"
    },
    {
        "rating": 5,
        "text": "The whole process is so simple and the agents are really prompt with repo ding and answering any questions!!",
        "date": "2024-11-25T21:37:31.000Z",
        "reviewer": "customer",
        "replies": "[\"Thank you for your business, Ms. Thomas!\"]"
    },
    {
        "rating": 5,
        "text": "Efficient and smooth. If you mess up and sign incorrectly they are on it quick. Let you know and try to help asap. Love them. Good job!!!!",
        "date": "2024-12-28T01:45:58.000Z",
        "reviewer": "MC",
        "replies": "[\"Thank you for your business, Ms. Coffey!\"]"
    },
    {
        "rating": 5,
        "text": "I appreciate it that they kept reaching out to me to see if I still need it alone. + My loan officer was sweet and funny and very knowledgeable. I will recommend you to other USPS employees",
        "date": "2024-05-21T19:38:22.000Z",
        "reviewer": "Billy",
        "replies": "[\"Thank you for your business, Ms. Robertson!\"]"
    },
    {
        "rating": 5,
        "text": "Thank you from the bottom of my heart. I was kind of skeptical about this transaction because I was literally just scammed about 2 weeks ago by applying for a loan online. You guys were great and was patient the whole process. Thank you",
        "date": "2024-05-04T03:25:34.000Z",
        "reviewer": "Annette Criswell",
        "replies": "[\"Thank you for your business, Ms. Criswell!\"]"
    },
    {
        "rating": 4,
        "text": "It was a fairly easy process. Communication was awesome! The only complaint I have and it is more on my side than your side is if someone doesn’t have monthly bills with their physical address because they have a Po Box the PO Box should be good enough if it is in the same town. I am sure I was a weird case though.",
        "date": "2024-06-13T23:44:21.000Z",
        "reviewer": "Heather Taylor",
        "replies": "[\"Thank you for your business, Ms. Taylor!\"]"
    },
    {
        "rating": 5,
        "text": "First great thing. I applied for postal allotment loan and was approved. I had a very difficult time with the final papers that were required in the end as I am a cell phone dummy. They were over the top polite helpful and PATIENT with me to get it finalized. Thanks again!",
        "date": "2024-05-18T03:48:21.000Z",
        "reviewer": "Jen",
        "replies": "[\"Thank you for your business, Ms. Moergeli!\"]"
    },
    {
        "rating": 5,
        "text": "Superior is an easy process. So long as you provide the documentation required they provide you with a fast answer. The ability to refinance every 6 months is great as well. Highly recommend.",
        "date": "2023-12-09T06:55:02.000Z",
        "reviewer": "Nikia Morrow",
        "replies": "[\"Thank you for your business, Ms. Morrow!\"]"
    },
    {
        "rating": 5,
        "text": "Brandy and Adoesha are so sweet and nice. They always make my experience so uncomplicated. Kuddos to them every time. thanks ladies keep up the above and beyond work",
        "date": "2024-05-13T20:30:43.000Z",
        "reviewer": "LaShawn Robinson",
        "replies": "[\"Thank you for your business, Ms. Robinson!\"]"
    },
    {
        "rating": 5,
        "text": "Love them no one would approve me for an allotment loan but they did they were easy breast the process was so sweet and funds were in my account the next day way to go!!!",
        "date": "2024-03-19T18:31:15.000Z",
        "reviewer": "Cordell Graham",
        "replies": "[\"Thank you for your business, Mr. Graham!\"]"
    },
    {
        "rating": 5,
        "text": "I Love the 2 Ladies you have, their customer service is above and beyond Adosia(hope I spelled correctly) and Brandy. You made my experience outstanding. Keep up the GOOD WORK LADIES!!!",
        "date": "2024-02-01T09:54:00.000Z",
        "reviewer": "LaShawn Robinson",
        "replies": "[\"Thanks so much for your business, Ms. Robinson!\"]"
    },
    {
        "rating": 5,
        "text": "The people are very helpful staff of people,",
        "date": "2025-01-21T18:18:49.000Z",
        "reviewer": "BRENDA",
        "replies": "[\"Thank you for your business, Ms. Robinson!\"]"
    },
    {
        "rating": 5,
        "text": "I was worried that I wouldn’t get approved because of my credit, but the process was easy and the staff was helpful and friendly. Will definitely use them again.",
        "date": "2024-08-13T20:47:50.000Z",
        "reviewer": "Divinity Becoat",
        "replies": "[\"Thank you for your business, Ms. Becoat!\"]"
    },
    {
        "rating": 5,
        "text": "Quick response, Loan are next day deposit when you are in the need",
        "date": "2024-12-23T23:46:27.000Z",
        "reviewer": "Micheal kinsey",
        "replies": "[\"Thank you for your business, Mr. Kinsey!\"]"
    },
    {
        "rating": 5,
        "text": "The process was fast and easy.. brandy was very helpful as well as the other reps.. I will recommend for any one looking for a smooth process thank you",
        "date": "2024-11-13T00:11:35.000Z",
        "reviewer": "ANGELA MONIQUE",
        "replies": "[\"Thank you for your business, Ms. Jackson!\"]"
    },
    {
        "rating": 5,
        "text": "It’s was quick no hassle and great customer service and patient. I am so glad I applied. I have shared with other coworkers",
        "date": "2024-11-05T16:41:15.000Z",
        "reviewer": "April",
        "replies": "[\"Thank you for your business, Ms. Fulghum!\"]"
    },
    {
        "rating": 5,
        "text": "Was fast and had a great experience and everyone was nice and helpful.",
        "date": "2024-12-21T01:36:30.000Z",
        "reviewer": "DUANE GARY",
        "replies": "[\"Thank you for your business, Mr. Gary!\"]"
    },
    {
        "rating": 5,
        "text": "I spoke with several different ladies while going through the process and each and everyone of them was very professional. Thank you all so much!",
        "date": "2024-06-20T22:23:43.000Z",
        "reviewer": "Sherylyn Mcrae",
        "replies": "[\"Thank you for your business, Ms. Mcrae!\"]"
    },
    {
        "rating": 2,
        "text": "I love the service but the process sucks. Even though you close at three, you should be able to keep the documents to the next day to start the process. I shouldn’t have to redo it every day. It makes no sense but it’s a great service anyway thank you.",
        "date": "2024-10-01T23:07:29.000Z",
        "reviewer": "JOCELYN",
        "replies": "[\"Thank you for your business, Ms. Goins! Because of the way our loan system is set up with daily interest accrual, everything must be done in the same day. We apologize for the inconvenience.\"]"
    },
    {
        "rating": 5,
        "text": "The representatives made sure I knew what to do and was there for any questions I had. I really appreciate that.",
        "date": "2024-10-29T21:39:43.000Z",
        "reviewer": "MELINDA",
        "replies": "[\"Thank you for your business, Ms. Jemison!\"]"
    },
    {
        "rating": 5,
        "text": "They are wonder was approved in 2 days an I thank superior lending me in a such time like this.they rescue me.....",
        "date": "2024-09-25T01:04:18.000Z",
        "reviewer": "customer",
        "replies": "[\"Thank you for your business, Ms. Ross!\"]"
    },
    {
        "rating": 5,
        "text": "They were very upfront and made it just as easy as it could possibly be. They weren't able to get me what I wanted but they were able to get me what they could give me so I was greatly appreciative of it so",
        "date": "2024-04-16T00:40:26.000Z",
        "reviewer": "Kati Grant",
        "replies": "[\"Thank you for your business, Ms. Grant!\"]"
    },
    {
        "rating": 1,
        "text": "I need help to done 2 Step, how to move 2 step plz",
        "date": "2025-01-21T15:30:53.000Z",
        "reviewer": "MD selim Uddin",
        "replies": "[\"I'm not sure that your review is meant for us. We offer small loans to USPS, VA, and DOD employees.\"]"
    },
    {
        "rating": 5,
        "text": "Great experience, Customer was great. Brandy was very helpful. i will be referring my coworkers and friends",
        "date": "2024-11-05T17:52:00.000Z",
        "reviewer": "Byrd, Kami - RD, SC",
        "replies": "[\"Thank you for your business, Ms. Byrd!\"]"
    },
    {
        "rating": 5,
        "text": "Great service ! Very quick and easy to apply , I will definitely be referring my coworkers !!",
        "date": "2024-11-14T00:50:43.000Z",
        "reviewer": "customer",
        "replies": "[\"Thank you for your business, Ms. Corrujedo!\"]"
    },
    {
        "rating": 5,
        "text": "When nobody would help me Superior did. Very easy process not to mention quick decision and payout. Glad I found this company. THANK YOU!!!!",
        "date": "2024-07-16T17:38:16.000Z",
        "reviewer": "TLH",
        "replies": "[\"Thank you for your business!\"]"
    },
    {
        "rating": 5,
        "text": "Great customer service for assisting me though the process. Very nice ☺️☺️",
        "date": "2024-12-09T23:34:49.000Z",
        "reviewer": "Korey Dixon",
        "replies": "[\"Thank you for your business, Mr. Dixon!\"]"
    },
    {
        "rating": 5,
        "text": "This is truly the best place to get a loan. Fast effective, pleasant experience as always. When I need quick funds they have always been there for me",
        "date": "2024-08-17T01:09:07.000Z",
        "reviewer": "Sun Shyne",
        "replies": "[\"Thank you for your business, Ms. Gregory!\"]"
    },
    {
        "rating": 5,
        "text": "It took a little while for the paperwork to be completed, but they were very helpful when I needed it. I’d recommend their service.",
        "date": "2024-09-20T21:40:27.000Z",
        "reviewer": "MY",
        "replies": "[\"Thank you for your business, Ms. Young! And thank you for your patience. We've been undergoing big changes!\"]"
    },
    {
        "rating": 5,
        "text": "Legit company. I was able to talk to a real person. She was awesome. And when I didn’t get a chance to talk to someone they would always email me consistently to answer any of my questions. I’d recommend to anyone.",
        "date": "2024-02-15T22:56:05.000Z",
        "reviewer": "Ken L",
        "replies": "[\"Thank you for your business, Ms. Lee!\"]"
    },
    {
        "rating": 5,
        "text": "Superior Funding was great to work with., They are professional fast and responsive. They answered emails and telephone calls immediately and made the application process painless. I would recommend them to anyone needing a little financial boost.",
        "date": "2024-08-23T16:23:59.000Z",
        "reviewer": "Inked78",
        "replies": "[\"Thank you for your business, Mr. Tatum!\"]"
    },
    {
        "rating": 5,
        "text": "Process was very fast and all instructions were easy to understand. Took about 30 minutes from start to finish! Would definitely recommend!",
        "date": "2024-01-09T01:12:30.000Z",
        "reviewer": "BRANDIE COATES",
        "replies": "[\"Thank you for your business, Ms. Coates!\"]"
    },
    {
        "rating": 5,
        "text": "Very pleased with the process, was fast, easy to apply for, customer service was great!",
        "date": "2024-11-08T15:41:53.000Z",
        "reviewer": "Faustina Lopez",
        "replies": "[\"Thank you for your business, Ms. Lopez!\"]"
    },
    {
        "rating": 5,
        "text": "Really quick and easy company. I intend on continuously working with them and referring them to anyone who needs them.",
        "date": "2024-08-12T17:53:03.000Z",
        "reviewer": "will moss",
        "replies": "[\"Thank you for your business, Mr. Moss!\"]"
    },
    {
        "rating": 5,
        "text": "Staff is very personable and professional. I have been with superior funding for a long time and they are great. They walk you through the whole process.",
        "date": "2024-01-30T05:53:10.000Z",
        "reviewer": "Elena",
        "replies": "[\"Thank you for your business, Ms. Wyche!\"]"
    },
    {
        "rating": 5,
        "text": "My experience was excellent, customer service is so amazing. They were very helpful and extremely patient. I have never experience such a helpful company. Thank you so much. HIGHLY RECOMMEND",
        "date": "2024-09-04T21:43:20.000Z",
        "reviewer": "Cecilia Lopez",
        "replies": "[\"Thank you for your business, Ms. Lopez!\"]"
    },
    {
        "rating": 5,
        "text": "My experience was quick and brief. Minimal effort and great value",
        "date": "2024-12-05T23:13:49.000Z",
        "reviewer": "John W",
        "replies": "[\"Thank you for your business, Mr. Whitfield!\"]"
    },
    {
        "rating": 5,
        "text": "i had to call numerous of times and they were very polite , and also they were on top of every email sent they responded quickly",
        "date": "2024-02-13T23:18:55.000Z",
        "reviewer": "traciecustomer",
        "replies": "[\"Thank you for your business, Ms. Ruben!\"]"
    }
]